rsx-electrical/STM32-ethernet/websocket_client_NUCLEO-F767ZI/rsx_ethernet/demo/st/nucleo_f767zi/web_socket_client_demo/src/main.c
    // Save current state
    prevState = state;

    // Loop delay
    osDelayTask(100);
  }
}

/**
 * @brief LED task
 * @param[in] param Unused parameter
 **/

void ledTask(void *param) {
  // Endless loop
  while (1) {
    BSP_LED_On(LED1);
    osDelayTask(100);
    BSP_LED_Off(LED1);
    osDelayTask(900);
  }
}

/**
 * @brief RSX task
 **/

void rsxTask(void *param) {
  rsx_test();
  osDelayTask(10000);
  Estop_test();
  osDeleteTask(NULL);
}

#define STATE_IDLE   0
#define ENABLE_5     1
#define ENABLE_12    2
#define ENABLE_19    3
#define ENABLE_24    4
#define ENABLE_55    5
#define ENABLE_ARM   6
#define ENABLE_MOTOR 7

void rsxButtonTask(void *param){
  int button_value = 0;
  while (1){
    if (buttonEventFlag) {
      // Clear flag
      buttonEventFlag = FALSE;
      switch(button_value) {
          case STATE_IDLE:
              bus_5v_on();
              BSP_LED_On(LED1);
              TRACE_INFO("RSX: 5V Enabled\r\n");
              button_value = ENABLE_5;
              break;

          case ENABLE_5:
              bus_12v_on();
              BSP_LED_Off(LED1);

              TRACE_INFO("RSX: 12V Enabled\r\n");
              button_value = ENABLE_12;
              break;

          case ENABLE_12:
              bus_19v_on();
              BSP_LED_On(LED1);
              TRACE_INFO("RSX: 19V Enabled\r\n");
              button_value = ENABLE_19;
              break;

          case ENABLE_19:
              bus_24v_on();
              BSP_LED_Off(LED1);

              TRACE_INFO("RSX: 24V Enabled\r\n");
              button_value = ENABLE_24;
              break;

          case ENABLE_24:
              bus_55v_on();
              BSP_LED_On(LED1);

              TRACE_INFO("RSX: 55V Enabled\r\n");
              button_value = ENABLE_55;
              break;

          case ENABLE_55:
              arm_on();
              BSP_LED_Off(LED1);
              TRACE_INFO("RSX: Arm Enabled\r\n");
              button_value = ENABLE_ARM;
              break;

          case ENABLE_ARM:
              motor_on();
              BSP_LED_On(LED1);
              TRACE_INFO("RSX: Motor Enabled\r\n");
              button_value = ENABLE_MOTOR;
              break;

          case ENABLE_MOTOR:
              shutoff_sequence();
              BSP_LED_Off(LED1);
              TRACE_INFO("RSX: All Systems Off\r\n");
              button_value = STATE_IDLE;
              break;

          default: 
              shutoff_sequence();
              button_value = STATE_IDLE;
              break;
      }
    }
  }
  // Check user button state

  

}

/**
 * @brief Main entry point
 * @return Unused value
 * @todo Call rsxTask in main()
 **/

int_t main(void) {
  error_t error;
  OsTaskId taskId;
  OsTaskParameters taskParams;
  NetInterface *interface;
  MacAddr macAddr;
#if (APP_USE_DHCP_CLIENT == DISABLED)
  Ipv4Addr ipv4Addr;
#endif
#if (APP_USE_SLAAC == DISABLED)
  Ipv6Addr ipv6Addr;
#endif

  // MPU configuration
  MPU_Config();
  // HAL library initialization
  HAL_Init();
  // Configure the system clock
  SystemClock_Config();

  // Enable I-cache and D-cache
  SCB_EnableICache();
  SCB_EnableDCache();

  // Initialize kernel
  osInitKernel();
  // Configure debug UART
  debugInit(115200);
  RSX_GPIO_Init();

  // Start-up message
  TRACE_INFO("\r\n");
  TRACE_INFO("****************************************\r\n");
  TRACE_INFO("*** CycloneTCP WebSocket Client Demo ***\r\n");
  TRACE_INFO("****************************************\r\n");
  TRACE_INFO("Copyright: 2010-2025 Oryx Embedded SARL\r\n");
  TRACE_INFO("Compiled: %s %s\r\n", __DATE__, __TIME__);
  TRACE_INFO("Target: STM32F767\r\n");
  TRACE_INFO("\r\n");

  // LED configuration
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  BSP_LED_Init(LED3);

  // Clear LEDs
  BSP_LED_Off(LED1);
  BSP_LED_Off(LED2);
  BSP_LED_Off(LED3);

  // Initialize user button
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);

  // Initialize hardware cryptographic accelerator
  error = stm32f7xxCryptoInit();
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize hardware crypto accelerator!\r\n");
  }

  // Generate a random seed
  error = trngGetRandomData(seed, sizeof(seed));
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to generate random data!\r\n");
  }

  // PRNG initialization
  error = hmacDrbgInit(&hmacDrbgContext, SHA256_HASH_ALGO);
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize PRNG!\r\n");
  }

  // Properly seed the PRNG
  error = hmacDrbgSeed(&hmacDrbgContext, seed, sizeof(seed));
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to seed PRNG!\r\n");
  }

  // TCP/IP stack initialization
  error = netInit();
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize TCP/IP stack!\r\n");
  }

  // Configure the first Ethernet interface
  interface = &netInterface[0];

  // Set interface name
  netSetInterfaceName(interface, APP_IF_NAME);
  // Set host name
  netSetHostname(interface, APP_HOST_NAME);
  // Set host MAC address
  macStringToAddr(APP_MAC_ADDR, &macAddr);
  netSetMacAddr(interface, &macAddr);
  // Select the relevant network adapter
  netSetDriver(interface, &stm32f7xxEthDriver);
  netSetPhyDriver(interface, &lan8742PhyDriver);

  // Initialize network interface
  error = netConfigInterface(interface);
  // Any error to report?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to configure interface %s!\r\n", interface->name);
  }

#if (IPV4_SUPPORT == ENABLED)
#if (APP_USE_DHCP_CLIENT == ENABLED)
  // Get default settings
  dhcpClientGetDefaultSettings(&dhcpClientSettings);
  // Set the network interface to be configured by DHCP
  dhcpClientSettings.interface = interface;
  // Disable rapid commit option
  dhcpClientSettings.rapidCommit = FALSE;

  // DHCP client initialization
  error = dhcpClientInit(&dhcpClientContext, &dhcpClientSettings);
  // Failed to initialize DHCP client?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize DHCP client!\r\n");
  }

