rsx-electrical/STM32-ethernet/websocket_client_NUCLEO-F767ZI/rsx_ethernet/demo/st/nucleo_f767zi/web_socket_client_demo/src/main.c
  // Start DHCP client
  error = dhcpClientStart(&dhcpClientContext);
  // Failed to start DHCP client?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to start DHCP client!\r\n");
  }
#else
  // Set IPv4 host address
  ipv4StringToAddr(APP_IPV4_HOST_ADDR, &ipv4Addr);
  ipv4SetHostAddr(interface, ipv4Addr);

  // Set subnet mask
  ipv4StringToAddr(APP_IPV4_SUBNET_MASK, &ipv4Addr);
  ipv4SetSubnetMask(interface, ipv4Addr);

  // Set default gateway
  ipv4StringToAddr(APP_IPV4_DEFAULT_GATEWAY, &ipv4Addr);
  ipv4SetDefaultGateway(interface, ipv4Addr);

  // Set primary and secondary DNS servers
  ipv4StringToAddr(APP_IPV4_PRIMARY_DNS, &ipv4Addr);
  ipv4SetDnsServer(interface, 0, ipv4Addr);
  ipv4StringToAddr(APP_IPV4_SECONDARY_DNS, &ipv4Addr);
  ipv4SetDnsServer(interface, 1, ipv4Addr);
#endif
#endif

#if (IPV6_SUPPORT == ENABLED)
#if (APP_USE_SLAAC == ENABLED)
  // Get default settings
  slaacGetDefaultSettings(&slaacSettings);
  // Set the network interface to be configured
  slaacSettings.interface = interface;

  // SLAAC initialization
  error = slaacInit(&slaacContext, &slaacSettings);
  // Failed to initialize SLAAC?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to initialize SLAAC!\r\n");
  }

  // Start IPv6 address autoconfiguration process
  error = slaacStart(&slaacContext);
  // Failed to start SLAAC process?
  if (error) {
    // Debug message
    TRACE_ERROR("Failed to start SLAAC!\r\n");
  }
#else
  // Set link-local address
  ipv6StringToAddr(APP_IPV6_LINK_LOCAL_ADDR, &ipv6Addr);
  ipv6SetLinkLocalAddr(interface, &ipv6Addr);

  // Set IPv6 prefix
  ipv6StringToAddr(APP_IPV6_PREFIX, &ipv6Addr);
  ipv6SetPrefix(interface, 0, &ipv6Addr, APP_IPV6_PREFIX_LENGTH);

  // Set global address
  ipv6StringToAddr(APP_IPV6_GLOBAL_ADDR, &ipv6Addr);
  ipv6SetGlobalAddr(interface, 0, &ipv6Addr);

  // Set default router
  ipv6StringToAddr(APP_IPV6_ROUTER, &ipv6Addr);
  ipv6SetDefaultRouter(interface, 0, &ipv6Addr);

  // Set primary and secondary DNS servers
  ipv6StringToAddr(APP_IPV6_PRIMARY_DNS, &ipv6Addr);
  ipv6SetDnsServer(interface, 0, &ipv6Addr);
  ipv6StringToAddr(APP_IPV6_SECONDARY_DNS, &ipv6Addr);
  ipv6SetDnsServer(interface, 1, &ipv6Addr);
#endif
#endif

  // Register RNG callback
  webSocketRegisterRandCallback(webSocketClientRngCallback);

  // Create an event object
  if (!osCreateEvent(&appEvent)) {
    // Debug message
    TRACE_ERROR("Failed to create event!\r\n");
  }

  // Set task parameters
  taskParams = OS_TASK_DEFAULT_PARAMS;
  taskParams.stackSize = 500;
  taskParams.priority = OS_TASK_PRIORITY_NORMAL;

  // Create user task
//  taskId = osCreateTask("User", userTask, NULL, &taskParams);
  // Failed to create the task?
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  // Set task parameters
  taskParams = OS_TASK_DEFAULT_PARAMS;
  taskParams.stackSize = 500;
  taskParams.priority = OS_TASK_PRIORITY_NORMAL;

  // Create a task to manage button events
  taskId = osCreateTask("Button", buttonTask, NULL, &taskParams);
  // Failed to create the task?
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  // Set task parameters
  taskParams = OS_TASK_DEFAULT_PARAMS;
  taskParams.stackSize = 200;
  taskParams.priority = OS_TASK_PRIORITY_NORMAL;

  // Create a task to blink the LED
  taskId = osCreateTask("LED", ledTask, NULL, &taskParams);
  // Failed to create the task?
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  taskId = osCreateTask("rsx", rsxTask, NULL, &taskParams);
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  taskId = osCreateTask("button", rsxButtonTask, NULL, &taskParams);
  if (taskId == OS_INVALID_TASK_ID) {
    // Debug message
    TRACE_ERROR("Failed to create task!\r\n");
  }

  // Start the execution of tasks
  osStartKernel();

  // This function should never return
  return 0;
}
